{
  "project": "CLedger",
  "branchName": "ralph/climbing-log-mvp",
  "description": "Personal climbing training session log - fast post-session entry with basic analytics, local-first with React frontend and Spring Boot backend",
  "userStories": [
    {
      "id": "US-001",
      "title": "Initialize Spring Boot backend project",
      "description": "As a developer, I need a Spring Boot backend project scaffold so we have a running server to build on.",
      "acceptanceCriteria": [
        "Spring Boot 3.x project with Gradle build in /backend directory",
        "Dependencies: Spring Web, Spring Data JPA, PostgreSQL driver, Flyway for migrations",
        "Application runs on port 8080",
        "Health check endpoint GET /api/health returns 200 OK",
        "application.yml configured for PostgreSQL connection (localhost:5432/cledger)",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Initialize React frontend project",
      "description": "As a developer, I need a React frontend project with ShadCN so we have a UI to build on.",
      "acceptanceCriteria": [
        "Vite + React + TypeScript project in /frontend directory",
        "ShadCN UI installed and configured with a default theme",
        "Tailwind CSS configured",
        "Dev server proxies /api requests to localhost:8080",
        "App renders a placeholder page at /",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Create session database schema",
      "description": "As a developer, I need the database schema for training sessions so we can persist session data.",
      "acceptanceCriteria": [
        "Flyway migration creates 'sessions' table with columns: id (UUID PK), date (date, not null), intensity (varchar, not null), performance (varchar, not null), productivity (varchar, not null), duration_minutes (integer, nullable), notes (text, nullable), max_grade (varchar, nullable), created_at (timestamp), updated_at (timestamp)",
        "Flyway migration creates 'session_types' join table with columns: session_id (FK to sessions), type (varchar, not null) — composite PK",
        "Flyway migration creates 'session_pain_flags' join table with columns: session_id (FK to sessions), location (varchar, not null) — composite PK",
        "Valid session types: boulder, routes, board, hangboard, strength, prehab",
        "Valid intensity values: easy, moderate, hard",
        "Valid performance values: weak, normal, strong",
        "Valid productivity values: low, normal, high",
        "Valid pain flag locations: finger, elbow, shoulder",
        "JPA entity created for sessions with @ElementCollection for types and pain flags",
        "Spring Data JPA repository created for sessions",
        "Application starts without errors",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Using @ElementCollection for session_types and session_pain_flags keeps the schema normalized without needing separate entities."
    },
    {
      "id": "US-004",
      "title": "Backend REST API for session CRUD",
      "description": "As a user, I want to create, read, update, and delete training sessions via the API.",
      "acceptanceCriteria": [
        "GET /api/sessions returns list of all sessions ordered by date descending, including their types and pain flags",
        "POST /api/sessions creates a new session (accepts date, types[], intensity, performance, productivity, durationMinutes, notes, maxGrade, hardAttempts, painFlags[])",
        "PUT /api/sessions/{id} updates an existing session",
        "DELETE /api/sessions/{id} deletes a session",
        "Returns 400 if required fields (date, types, intensity, performance, productivity) are missing or invalid",
        "Returns 404 if session not found on GET/PUT/DELETE by id",
        "Responses use DTOs, not raw entities",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Uses @Valid for request validation, custom domain validation in SessionService for enum values."
    },
    {
      "id": "US-005",
      "title": "Frontend app shell with navigation",
      "description": "As a user, I want a clean app layout with navigation so I can switch between logging and viewing sessions.",
      "acceptanceCriteria": [
        "App has a sidebar or top nav with title 'CLedger'",
        "Navigation links: 'Sessions' and 'Dashboard'",
        "React Router set up with routes: / (redirects to /sessions), /sessions, /sessions/new, /sessions/:id/edit, /dashboard",
        "Main content area renders the active route's component",
        "Uses ShadCN components for layout",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Top nav layout with React Router. ShadCN Button component installed. ESLint configured to allow ShadCN UI component exports."
    },
    {
      "id": "US-006",
      "title": "Frontend session timeline list",
      "description": "As a user, I want to see all my training sessions in a timeline ordered by date so I can quickly scan recent weeks.",
      "acceptanceCriteria": [
        "Route /sessions shows a list of all sessions fetched from GET /api/sessions",
        "Each session row shows: date, session types (as badges), intensity, performance, productivity",
        "Sessions are grouped by week or shown with clear date separators",
        "Shows 'No sessions yet' message when empty",
        "'Log Session' button navigates to /sessions/new",
        "Each session row is clickable and navigates to /sessions/:id/edit",
        "Uses ShadCN Card or Table components",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Uses @tanstack/react-query for data fetching with QueryClientProvider in App.tsx. Sessions grouped by ISO week with ShadCN Card and Badge components."
    },
    {
      "id": "US-007",
      "title": "Frontend session logging form",
      "description": "As a user, I want to log a new training session quickly using a form optimized for fast entry.",
      "acceptanceCriteria": [
        "Route /sessions/new shows a session logging form",
        "Date field defaults to today, uses a date picker",
        "Session types rendered as multi-select toggle buttons (boulder, routes, board, hangboard, strength, prehab)",
        "Intensity selector with three options: Easy / Moderate / Hard (radio group or segmented control)",
        "Performance selector with three options: Weak / Normal / Strong",
        "Productivity selector with three options: Low / Normal / High",
        "Optional duration field (number input, minutes)",
        "Optional max grade field (text input)",
        "Optional hard attempts field (number input)",
        "Optional pain flags as multi-select checkboxes (finger, elbow, shoulder)",
        "Notes textarea",
        "Submit button calls POST /api/sessions and navigates back to /sessions",
        "Cancel button navigates back without saving",
        "Uses ShadCN components (ToggleGroup, RadioGroup, Input, Textarea, Button, Calendar)",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Form uses ShadCN ToggleGroup, RadioGroup, Calendar/Popover, Input, Textarea, Checkbox. Defaults: intensity=moderate, performance=normal, productivity=normal. Submit disabled when no types selected. Reusable SessionForm component for create and edit."
    },
    {
      "id": "US-008",
      "title": "Frontend session edit form",
      "description": "As a user, I want to edit an existing session so I can correct mistakes or add details later.",
      "acceptanceCriteria": [
        "Route /sessions/:id/edit shows the same form as /sessions/new but pre-filled with existing session data",
        "Form fetches session data from GET /api/sessions (or a dedicated GET /api/sessions/:id endpoint)",
        "Submit button calls PUT /api/sessions/{id} and navigates back to /sessions",
        "Delete button with confirmation dialog calls DELETE /api/sessions/{id} and navigates back to /sessions",
        "Reuses the same form component as the create form",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Reuses SessionForm component with initialData prop. Uses ShadCN AlertDialog for delete confirmation. API functions: fetchSession, updateSession, deleteSession in sessions.ts."
    },
    {
      "id": "US-009",
      "title": "Backend analytics endpoint",
      "description": "As a user, I want computed analytics about my training so I can see volume and trends at a glance.",
      "acceptanceCriteria": [
        "GET /api/analytics returns a JSON object with: sessionsThisWeek (int), hardSessionsLast7Days (int), daysSinceLastRestDay (int), painFlagsLast30Days (array of {location, count}), weeklySessionCounts (array of {weekStart, count} for last 8 weeks)",
        "A 'rest day' is any day with no session logged",
        "daysSinceLastRestDay counts from today backward to the most recent day without a session",
        "weeklySessionCounts uses ISO weeks",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 9,
      "passes": true,
      "notes": "AnalyticsService accepts LocalDate parameter for testability. Uses JPQL queries in SessionRepository for counting. daysSinceLastRestDay looks back up to 365 days."
    },
    {
      "id": "US-010",
      "title": "Frontend analytics dashboard",
      "description": "As a user, I want a dashboard showing my training analytics so I can reflect on my recent training load.",
      "acceptanceCriteria": [
        "Route /dashboard fetches data from GET /api/analytics",
        "Displays: sessions this week, hard sessions in last 7 days, days since last rest day as stat cards",
        "Displays pain flags in last 30 days as a summary (e.g., 'Finger: 3, Elbow: 1')",
        "Displays weekly session counts as a simple bar chart or visual indicator for the last 8 weeks",
        "Uses ShadCN Card components for stat cards",
        "Typecheck passes"
      ],
      "priority": 10,
      "passes": true,
      "notes": "CSS-based bar chart with stat cards for metrics, pain flag summary, and weekly session counts. Tests mock fetchAnalytics and verify all dashboard sections."
    },
    {
      "id": "US-011",
      "title": "Performance and productivity trend analytics",
      "description": "As a user, I want to see trends in my subjective performance and productivity ratings over time.",
      "acceptanceCriteria": [
        "GET /api/analytics response includes performanceTrend and productivityTrend arrays",
        "Each trend array contains objects with {weekStart, average} for the last 8 weeks",
        "Average is computed by mapping weak/low=1, normal=2, strong/high=3 and averaging per week",
        "Dashboard displays these trends as a simple line or bar visualization",
        "Weeks with no sessions show null or are omitted",
        "Typecheck passes"
      ],
      "priority": 11,
      "passes": true,
      "notes": "WeeklyTrend DTO with nullable Double average. Backend computes trends in AnalyticsService using findByDateBetween and maps weak/low=1, normal=2, strong/high=3. Frontend TrendChart component reuses bar-chart pattern with height mapped from 1-3 scale. Null weeks show em-dash."
    },
    {
      "id": "US-012",
      "title": "Add venue field to sessions",
      "description": "As a user, I want to log which venue (gym/crag) a session was at, with autocomplete suggestions from previously used venues.",
      "acceptanceCriteria": [
        "Flyway migration adds 'venue' varchar(255) nullable column to the sessions table",
        "Session JPA entity updated with venue field",
        "Session DTOs (request and response) include venue as an optional string field",
        "POST and PUT /api/sessions accept and persist the venue field",
        "GET /api/sessions returns the venue field in each session response",
        "New endpoint GET /api/venues returns a distinct, alphabetically sorted list of all venue names previously used across sessions",
        "Session form includes a venue input field with autocomplete/combobox behavior",
        "Autocomplete fetches suggestions from GET /api/venues and filters as the user types",
        "User can type a new venue name not in the list (free text entry)",
        "Session timeline list shows venue when present",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 12,
      "passes": true,
      "notes": "Uses ShadCN Popover+Command pattern for venue autocomplete. GET /api/venues returns distinct venues via JPQL query. cmdk requires scrollIntoView polyfill in test setup. shouldFilter=false on Command with manual filtering for the combobox pattern."
    },
    {
      "id": "US-013",
      "title": "Flexible pain/injury logging with location autocomplete and notes",
      "description": "As a user, I want to log pain or injuries with a free-form location (not limited to finger/elbow/shoulder) and an optional note per entry, so I can track issues more precisely.",
      "acceptanceCriteria": [
        "Flyway migration drops the existing session_pain_flags table and creates a new 'session_injuries' table with columns: id (UUID PK), session_id (FK to sessions, not null), location (varchar, not null), note (text, nullable)",
        "Session JPA entity replaces the @ElementCollection pain flags with a @OneToMany relationship to a new SessionInjury entity",
        "Session request DTO accepts injuries as an array of {location, note} objects instead of the old painFlags string array",
        "Session response DTO returns injuries as an array of {id, location, note} objects",
        "POST and PUT /api/sessions accept and persist the injuries array, replacing all existing injuries for that session on update",
        "New endpoint GET /api/injury-locations returns a distinct, alphabetically sorted list of all injury location strings previously used across sessions",
        "Session form replaces the pain flag checkboxes with a dynamic list where the user can add multiple injury entries",
        "Each injury entry has a location field (combobox with autocomplete from GET /api/injury-locations, free text allowed) and an optional note text input",
        "User can add and remove injury entries in the form",
        "Session timeline list displays injury locations as badges (replacing the old pain flag badges)",
        "Analytics endpoint (GET /api/analytics) painFlagsLast30Days is updated to use the new injuries table, grouping by location",
        "Dashboard pain flag summary reflects the new data",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 13,
      "passes": true,
      "notes": "Flyway V3 migration drops session_pain_flags and creates session_injuries. SessionInjury entity with @OneToMany replaces @ElementCollection. InjuryLocationController provides GET /api/injury-locations. Frontend uses dynamic injury entries with Popover+Command combobox autocomplete (same pattern as venue). Tests updated across all layers."
    },
    {
      "id": "US-015",
      "title": "Add 'Other' session type",
      "description": "As a user, I want an 'Other' session type for non-climbing training like skiing, swimming, running, etc.",
      "acceptanceCriteria": [
        "'other' added as a valid session type in backend validation",
        "Frontend session form toggle buttons include 'Other' alongside the existing types",
        "Sessions with type 'other' display correctly in the timeline list",
        "No database migration needed — session_types already stores arbitrary varchar values",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 15,
      "passes": true,
      "notes": "Added 'other' to VALID_TYPES in SessionService.java and SESSION_TYPES in types.ts. No migration needed."
    },
    {
      "id": "US-016",
      "title": "Remove hard attempts tracking",
      "description": "As a user, I no longer want the 'hard attempts' field because it's unclear and hard to use.",
      "acceptanceCriteria": [
        "Flyway migration drops the 'hard_attempts' column from the sessions table (or marks it nullable/unused if safer)",
        "Session JPA entity no longer has a hardAttempts field",
        "Session request and response DTOs no longer include hardAttempts",
        "Session form no longer shows the hard attempts input",
        "Session timeline does not display hard attempts",
        "Analytics endpoint hardSessionsLast7Days continues to work (it uses intensity, not hard attempts)",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 16,
      "passes": true,
      "notes": "V4 migration drops hard_attempts column. Removed from entity, DTOs, service, form, and all tests."
    },
    {
      "id": "US-017",
      "title": "Color coding for intensity, performance, and productivity scores",
      "description": "As a user, I want color-coded badges for intensity, performance, and productivity on the session timeline so I can scan quality at a glance.",
      "acceptanceCriteria": [
        "Performance badges: Strong = green, Normal = neutral/default, Weak = red/orange",
        "Productivity badges: High = green, Normal = neutral/default, Low = red/orange",
        "Intensity badges: Hard = orange/red, Moderate = neutral/default, Easy = yellow/amber",
        "Colors applied on the session timeline list cards",
        "Colors use Tailwind utility classes or CSS variables consistent with the app theme",
        "Color coding is accessible (not relying on color alone — text labels remain visible)",
        "Typecheck passes"
      ],
      "priority": 17,
      "passes": true,
      "notes": "Uses helper functions (intensityColor, performanceColor, productivityColor) returning Tailwind classes. Badges use bg-opacity pattern for colored backgrounds with matching text. Green for positive (strong/high), red for negative (weak/low), orange for hard intensity, amber for easy, secondary for neutral/default."
    },
    {
      "id": "US-018",
      "title": "Upgrade dashboard charts to ShadCN chart component",
      "description": "As a user, I want polished, interactive charts on the dashboard instead of the CSS-based bar charts.",
      "acceptanceCriteria": [
        "Install and configure the ShadCN chart component (which uses Recharts under the hood)",
        "Weekly session counts rendered as a bar chart using ShadCN Chart",
        "Performance trend rendered as a line chart using ShadCN Chart",
        "Productivity trend rendered as a line chart using ShadCN Chart",
        "Charts are responsive and fit the dashboard layout",
        "Replace all existing CSS-based chart implementations",
        "Typecheck passes"
      ],
      "priority": 18,
      "passes": true,
      "notes": "ShadCN chart component with Recharts. BarChart for weekly sessions, LineChart for performance/productivity trends. ChartContainer with ChartConfig for theming via CSS variables. Recharts doesn't render in jsdom (zero width/height) so tests verify chart container presence via data-slot attribute."
    },
    {
      "id": "US-019",
      "title": "Dark mode with blue-gray theme",
      "description": "As a user, I want a dark mode UI with slightly dark gray and blue tones for comfortable use.",
      "acceptanceCriteria": [
        "App uses a dark theme by default — dark gray background with subtle blue tones",
        "ShadCN theming system used to define the dark color palette via CSS variables in globals.css",
        "The 'dark' class is applied to the HTML root element",
        "All existing components (cards, badges, buttons, forms, charts, nav) render correctly in dark mode",
        "Text has sufficient contrast against dark backgrounds",
        "Form inputs and comboboxes are styled for dark mode",
        "No light-mode flash on page load",
        "Typecheck passes"
      ],
      "priority": 19,
      "passes": true,
      "notes": "Dark class set on <html> in index.html. Dark theme CSS variables in index.css use oklch with hue 250-260 for blue-gray tones. Primary uses blue accent. No light-mode flash since dark class is in static HTML."
    },
    {
      "id": "US-020",
      "title": "MCP server for LLM-based training coach access",
      "description": "As a user, I want an MCP server that exposes my training log data so an LLM agent can act as a training coach — reviewing my sessions, spotting patterns, flagging overtraining, and giving advice.",
      "acceptanceCriteria": [
        "MCP server project in /mcp-server directory (Node.js/TypeScript using the @modelcontextprotocol/sdk package)",
        "Server connects to the CLedger REST API (configurable base URL, default http://localhost:8080)",
        "Tool: list_sessions — returns sessions with all fields (types, intensity, performance, productivity, venue, injuries, notes, duration, max grade), supports optional date range filter (from/to) and limit parameter",
        "Tool: get_session — returns a single session by ID with full detail",
        "Tool: list_injuries — returns standalone injuries, supports optional date range filter",
        "Tool: get_analytics — returns the full analytics payload (weekly counts, trends, pain flags, rest days)",
        "Tool: log_session — creates a new session (all session fields as parameters)",
        "Tool: log_injury — creates a new standalone injury",
        "Tool: get_training_summary — a convenience tool that returns a structured overview: sessions from the last 14 days, current analytics, recent injuries, and training streak info — designed to give an LLM coach a quick snapshot without multiple calls",
        "Each tool has clear descriptions and parameter schemas so the LLM understands what data is available and what each field means (e.g., intensity scale, performance/productivity meaning)",
        "Server runs via stdio transport (compatible with Claude Desktop and other MCP clients)",
        "README.md in /mcp-server with setup instructions and Claude Desktop configuration snippet",
        "Typecheck passes"
      ],
      "priority": 20,
      "passes": true,
      "notes": "The get_training_summary tool is key for coaching — it gives the LLM enough context in one call to reason about training load, recovery, and trends. Individual tools allow follow-up drill-down. Write/log tools let the coach help with session entry too."
    },
    {
      "id": "US-021",
      "title": "Coach insights: backend API, frontend UI, and MCP integration",
      "description": "As a user, I want a 'Coach Insights' section where an LLM training coach can persist its thoughts, recommendations, and plans — and where I can view, edit, and manage them in the UI.",
      "acceptanceCriteria": [
        "Flyway migration creates 'coach_insights' table with columns: id (UUID PK), content (text, not null), pinned (boolean, default false), created_at (timestamp), updated_at (timestamp)",
        "JPA entity and repository for CoachInsight",
        "REST API: GET /api/insights (list, ordered by pinned desc then updated_at desc), POST /api/insights, PUT /api/insights/{id}, DELETE /api/insights/{id}",
        "Request DTO accepts content and pinned fields; response DTO includes all fields plus id and timestamps",
        "Frontend: 'Insights' navigation link added to the app nav",
        "Route /insights shows a list of all insights ordered by pinned first, then most recently updated",
        "Each insight card shows content (full or truncated with expand), pinned indicator, and timestamps",
        "Clicking an insight opens it in a detail/edit view",
        "'Add Insight' button opens a form with content (textarea) and pinned (checkbox)",
        "Edit and delete supported from the detail view",
        "Pinned insights appear at the top of the list",
        "MCP server: Tool list_insights — returns all insights",
        "MCP server: Tool add_insight — creates a new insight (content, pinned parameters)",
        "MCP server: Tool update_insight — updates an existing insight by ID",
        "MCP server: get_training_summary includes the most recent 5 insights (prioritizing pinned) so the coach has context on its own previous reasoning",
        "Typecheck passes (compiles without errors)"
      ],
      "priority": 21,
      "passes": false,
      "notes": "Insights are free-form text — no categories or titles. The LLM coach can structure the content however it wants (observations, plans, warnings all in one block). Including recent insights in get_training_summary creates a feedback loop — the coach sees its own prior reasoning and can build on it or revise."
    }
  ]
}
